# Q1. 以下の配列から、期待された結果の配列を作成してください
# [1, 2, 3, 4, 5]
# 期待する配列

#  [1, 3, 5, 7, 9]

list = [1, 2, 3, 4, 5]
p list.map.with_index{|num,i|
    num+i
}

# Q2. 以下の配列から、期待された結果の配列を作成してください
# ["田中", "佐藤", "佐々木", "高橋"]
# 期待する配列
# ["田中", "佐藤", "佐々木", "高橋", "斎藤"]

name = ["田中", "佐藤", "佐々木", "高橋"]
name << "斎藤"
puts name

# Q3. 以下の文字列の配列を数字だけの配列に変換してください
# ["1", "2", "3", "4", "5"]
# 期待する配列
# [1, 2, 3, 4, 5]

num = ["1", "2", "3", "4", "5"]
p num.map(&:to_i)

# Q4. 以下の二つの配列を合体させた新しい配列を作成してください
# ["dog", "cat", "fish"]
# ["bird", "bat", "tiger"]

animal1 = ["dog", "cat", "fish"]
animal2 = ["bird", "bat", "tiger"]
p animal1 + animal2

# Q5. 以下の配列の中に3がいくつあるか数えるコードを書いてください
# [1, 5, 8, 10, 2, 3, 2, 3, 3, 1, 4, 5, 9]

num = [1, 5, 8, 10, 2, 3, 2, 3, 3, 1, 4, 5, 9]
puts num.count(3)